reason_hints = {
    'ава': {
        "неадекватная": "Неадекватное содержание на аватарке",
        'оскорбительная': "Оскорбительный аватар",
        "политическая": "Политический аватар",
        "нацистская": "Нацистская символике на аватарке",
        "18+": "18+ аватар",
        "с рекламой": "Реклама на аватарке",
    },
    'ник': {
        "неадекватный": "Неадекватный никнейм",
        "оскорбительный": "Оскорбительный никнейм",
        "политический": "Политический никнейм",
        "нацистский": "Нацистское содержание в никнейме",
        "невидимый": "Невидимый никнейм",
        "18+": "18+ никнейм",
        "с тэгом без роли": "Наличие тэга неподтвержденного ролью",
    },
    'статус': {
        "неадекватный": "Неадекватный статус",
        "оскорбительный": "Оскорбительный статус",
        "политический": "Политический статус",
        "нацистский": "Нацистское содержание в статусе",
        "18+": "18+ статус",
    },
    "обо мне": {
        "неадекватное": "Неадекватное \"обо мне\"",
        "оскорбительное": "Оскорбительное \"обо мне\"",
        "политическое": "Политическое \"обо мне\"",
        "нацистское": "Нацистское содержание в \"обо мне\"",
        "18+": "18+ \"обо мне\"",
    },
    "местоимение": {
        "неадекватное": "Неадекватное местоимение",
        "оскорбительное": "Оскорбительное местоимение",
        "политическое": "Политическое местоимение",
        "нацистское": "Нацистское содержание в местоимении",
        "18+": "18+ местоимение",
    },
    "текст": {
        "флуд": "Flood",
        "капс": "Caps",
        "спам": "Spam",
        "скам ссылка": "Распространение скам-ссылок",
        "команды": "Использование команд ботов не предназначенных для обычных пользователей",
        "скримеры": "Отправка скримеров",
        "файлы для скачивания": "Отправка файлов для доступных только для скачивания",
    },
    "войс": {
        "помеха в вопросах": "Помеха в канале для вопросов",
        "посторонние звуки": "Посторонние звуки",
        "саундпад": "SoundPad",
        "троллинг модерации": "Троллинг модерации",
        "изменение голоса с целью обмана": "Изменение голоса (с целью обмана)",
    },
    "оск": {
        "обычный (пользователя)": "Оскорбление",
        "неадекватное поведение": "Неадекватное поведение",
        "родителей": "Оскорбление родителей",
        "родителей (упом)": "Упоминание родителей",
        "модератора": "Оскорбление модерации",
        "проекта": "Оскорбление проекта",
        "разведение конфликта": "Разведение конфликта",
        "пожелание смерти": "Призыв к суициду",
    },
    "слив": {
        "личной информации": "Слив личной информации",
        "модерации": "Слив модерации",
        "администрации": "Слив администрации",
        "закрытой инфы (проекта)": "Распространение закрытой от игроков информации",
    },
    "реклама": {
        "стороннего ПО": "Реклама стороннего ПО",
        "сторонней игры (GTA) на демке": "Трансляция сторонней игры из индустрии GTA",
        "личных услуг": "Реклама личных услуг",
        "сторонних ресурсов (общее)": "Реклама сторонних ресурсов",
    }
}

profile_reasons = ("ава", "ник", "статус", "обо мне", "местоимение")
tags = ('рецидив', 'заувал.', 'перевыдача')
